xcweaver/socialnetwork/evaluation/local/2024-05-22_14:29:02_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 60.191ms, rate sampling interval: 193ms
  Thread calibration: mean lat.: 47.718ms, rate sampling interval: 203ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    46.97ms   34.13ms 173.70ms   87.21%
    Req/Sec    23.97      9.98    44.00     72.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.68ms
 75.000%   57.79ms
 90.000%   92.93ms
 99.000%  173.70ms
 99.900%  227.07ms
 99.990%  237.31ms
 99.999%  237.31ms
100.000%  237.31ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.815     0.000000            1         1.00
      18.575     0.100000           98         1.11
      21.279     0.200000          197         1.25
      24.575     0.300000          294         1.43
      28.911     0.400000          391         1.67
      35.679     0.500000          489         2.00
      39.647     0.550000          538         2.22
      43.295     0.600000          587         2.50
      47.935     0.650000          637         2.86
      52.799     0.700000          684         3.33
      57.791     0.750000          733         4.00
      60.863     0.775000          758         4.44
      66.239     0.800000          782         5.00
      71.679     0.825000          807         5.71
      76.607     0.850000          831         6.67
      81.407     0.875000          855         8.00
      87.551     0.887500          868         8.89
      93.311     0.900000          881        10.00
      98.111     0.912500          892        11.43
     102.079     0.925000          904        13.33
     109.823     0.937500          916        16.00
     114.303     0.943750          923        17.78
     116.095     0.950000          929        20.00
     120.767     0.956250          935        22.86
     126.655     0.962500          941        26.67
     131.199     0.968750          948        32.00
     136.191     0.971875          950        35.56
     141.951     0.975000          953        40.00
     145.407     0.978125          956        45.71
     150.271     0.981250          959        53.33
     160.127     0.984375          962        64.00
     160.767     0.985938          964        71.11
     164.863     0.987500          965        80.00
     173.695     0.989062          967        91.43
     177.279     0.990625          968       106.67
     193.791     0.992188          970       128.00
     194.303     0.992969          971       142.22
     194.303     0.993750          971       160.00
     204.287     0.994531          972       182.86
     211.583     0.995313          973       213.33
     213.247     0.996094          974       256.00
     213.247     0.996484          974       284.44
     213.247     0.996875          974       320.00
     217.087     0.997266          975       365.71
     217.087     0.997656          975       426.67
     227.071     0.998047          976       512.00
     227.071     0.998242          976       568.89
     227.071     0.998437          976       640.00
     227.071     0.998633          976       731.43
     227.071     0.998828          976       853.33
     237.311     0.999023          977      1024.00
     237.311     1.000000          977          inf
#[Mean    =       46.970, StdDeviation   =       34.130]
#[Max     =      237.184, Total count    =          977]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1505 requests in 30.00s, 621.37KB read
Requests/sec:     50.16
Transfer/sec:     20.71KB
