xcweaver/socialnetwork/evaluation/local/2024-05-22_14:33:34_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 45.432ms, rate sampling interval: 157ms
  Thread calibration: mean lat.: 49.196ms, rate sampling interval: 170ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    53.58ms   44.94ms 282.88ms   90.54%
    Req/Sec    24.16     10.24    44.00     66.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   40.74ms
 75.000%   64.70ms
 90.000%   97.41ms
 99.000%  282.88ms
 99.900%  346.88ms
 99.990%  348.67ms
 99.999%  348.67ms
100.000%  348.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.847     0.000000            1         1.00
      20.287     0.100000           99         1.11
      23.151     0.200000          197         1.25
      27.615     0.300000          295         1.43
      33.407     0.400000          394         1.67
      40.735     0.500000          492         2.00
      44.607     0.550000          541         2.22
      49.375     0.600000          591         2.50
      54.335     0.650000          639         2.86
      58.655     0.700000          689         3.33
      64.799     0.750000          738         4.00
      68.351     0.775000          762         4.44
      72.511     0.800000          787         5.00
      76.927     0.825000          811         5.71
      84.287     0.850000          836         6.67
      91.327     0.875000          861         8.00
      95.487     0.887500          873         8.89
      97.407     0.900000          886        10.00
     102.399     0.912500          897        11.43
     107.775     0.925000          910        13.33
     113.535     0.937500          922        16.00
     115.839     0.943750          928        17.78
     119.999     0.950000          934        20.00
     126.015     0.956250          940        22.86
     137.215     0.962500          947        26.67
     142.463     0.968750          953        32.00
     145.279     0.971875          956        35.56
     154.239     0.975000          959        40.00
     171.647     0.978125          962        45.71
     211.839     0.981250          965        53.33
     237.695     0.984375          968        64.00
     260.991     0.985938          970        71.11
     271.359     0.987500          971        80.00
     282.879     0.989062          973        91.43
     286.719     0.990625          974       106.67
     294.399     0.992188          976       128.00
     310.271     0.992969          977       142.22
     310.271     0.993750          977       160.00
     334.591     0.994531          978       182.86
     339.455     0.995313          979       213.33
     344.319     0.996094          980       256.00
     344.319     0.996484          980       284.44
     344.319     0.996875          980       320.00
     344.575     0.997266          981       365.71
     344.575     0.997656          981       426.67
     346.879     0.998047          982       512.00
     346.879     0.998242          982       568.89
     346.879     0.998437          982       640.00
     346.879     0.998633          982       731.43
     346.879     0.998828          982       853.33
     348.671     0.999023          983      1024.00
     348.671     1.000000          983          inf
#[Mean    =       53.585, StdDeviation   =       44.936]
#[Max     =      348.416, Total count    =          983]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1505 requests in 30.00s, 621.35KB read
Requests/sec:     50.16
Transfer/sec:     20.71KB
