xcweaver/socialnetwork/evaluation/local/2024-06-20_18:15:13_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 57.429ms, rate sampling interval: 230ms
  Thread calibration: mean lat.: 73.770ms, rate sampling interval: 370ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    70.57ms   68.68ms 430.59ms   90.23%
    Req/Sec    24.16      7.94    43.00     70.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   50.21ms
 75.000%   86.01ms
 90.000%  137.47ms
 99.000%  430.59ms
 99.900%  502.27ms
 99.990%  513.02ms
 99.999%  513.02ms
100.000%  513.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      12.951     0.000000            1         1.00
      21.983     0.100000           99         1.11
      25.327     0.200000          197         1.25
      32.287     0.300000          295         1.43
      40.927     0.400000          395         1.67
      50.207     0.500000          492         2.00
      56.415     0.550000          541         2.22
      61.983     0.600000          591         2.50
      68.927     0.650000          639         2.86
      77.759     0.700000          689         3.33
      86.079     0.750000          739         4.00
      91.391     0.775000          762         4.44
      97.535     0.800000          787         5.00
     106.047     0.825000          811         5.71
     113.151     0.850000          836         6.67
     124.735     0.875000          861         8.00
     129.343     0.887500          873         8.89
     137.471     0.900000          885        10.00
     141.951     0.912500          897        11.43
     148.351     0.925000          910        13.33
     157.311     0.937500          922        16.00
     165.631     0.943750          928        17.78
     175.487     0.950000          934        20.00
     183.935     0.956250          940        22.86
     191.743     0.962500          947        26.67
     209.535     0.968750          953        32.00
     226.687     0.971875          956        35.56
     260.607     0.975000          959        40.00
     279.551     0.978125          962        45.71
     331.775     0.981250          965        53.33
     402.943     0.984375          968        64.00
     418.559     0.985938          970        71.11
     423.423     0.987500          971        80.00
     430.591     0.989062          973        91.43
     433.151     0.990625          974       106.67
     447.487     0.992188          976       128.00
     460.031     0.992969          977       142.22
     460.031     0.993750          977       160.00
     462.079     0.994531          978       182.86
     462.591     0.995313          979       213.33
     477.439     0.996094          980       256.00
     477.439     0.996484          980       284.44
     477.439     0.996875          980       320.00
     478.975     0.997266          981       365.71
     478.975     0.997656          981       426.67
     502.271     0.998047          982       512.00
     502.271     0.998242          982       568.89
     502.271     0.998437          982       640.00
     502.271     0.998633          982       731.43
     502.271     0.998828          982       853.33
     513.023     0.999023          983      1024.00
     513.023     1.000000          983          inf
#[Mean    =       70.569, StdDeviation   =       68.679]
#[Max     =      512.768, Total count    =          983]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1503 requests in 30.00s, 689.52KB read
Requests/sec:     50.10
Transfer/sec:     22.98KB
