xcweaver/socialnetwork/evaluation/local/2024-06-20_18:17:35_workload.txt
Running 30s test @ http://localhost:9000/wrk2-api/post/compose
  2 threads and 2 connections
  Thread calibration: mean lat.: 58.702ms, rate sampling interval: 207ms
  Thread calibration: mean lat.: 99.375ms, rate sampling interval: 397ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    80.95ms   59.40ms 270.33ms   81.00%
    Req/Sec    24.13      8.37    40.00     76.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   61.31ms
 75.000%  107.26ms
 90.000%  168.32ms
 99.000%  270.33ms
 99.900%  348.67ms
 99.990%  370.17ms
 99.999%  370.17ms
100.000%  370.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      16.831     0.000000            1         1.00
      25.199     0.100000           99         1.11
      32.703     0.200000          197         1.25
      42.271     0.300000          296         1.43
      51.167     0.400000          394         1.67
      61.311     0.500000          493         2.00
      67.007     0.550000          542         2.22
      75.647     0.600000          592         2.50
      84.863     0.650000          640         2.86
      94.271     0.700000          689         3.33
     107.263     0.750000          738         4.00
     115.263     0.775000          764         4.44
     123.263     0.800000          788         5.00
     131.967     0.825000          812         5.71
     141.311     0.850000          837         6.67
     152.831     0.875000          861         8.00
     158.463     0.887500          874         8.89
     168.319     0.900000          886        10.00
     173.823     0.912500          898        11.43
     180.863     0.925000          912        13.33
     189.311     0.937500          923        16.00
     201.343     0.943750          929        17.78
     206.975     0.950000          935        20.00
     210.815     0.956250          941        22.86
     218.495     0.962500          948        26.67
     228.991     0.968750          954        32.00
     231.807     0.971875          957        35.56
     237.695     0.975000          960        40.00
     247.039     0.978125          964        45.71
     247.679     0.981250          966        53.33
     250.367     0.984375          969        64.00
     257.023     0.985938          971        71.11
     262.655     0.987500          972        80.00
     270.335     0.989062          974        91.43
     275.199     0.990625          975       106.67
     293.887     0.992188          978       128.00
     293.887     0.992969          978       142.22
     293.887     0.993750          978       160.00
     300.031     0.994531          979       182.86
     334.335     0.995313          980       213.33
     336.895     0.996094          981       256.00
     336.895     0.996484          981       284.44
     336.895     0.996875          981       320.00
     343.551     0.997266          982       365.71
     343.551     0.997656          982       426.67
     348.671     0.998047          983       512.00
     348.671     0.998242          983       568.89
     348.671     0.998437          983       640.00
     348.671     0.998633          983       731.43
     348.671     0.998828          983       853.33
     370.175     0.999023          984      1024.00
     370.175     1.000000          984          inf
#[Mean    =       80.954, StdDeviation   =       59.397]
#[Max     =      369.920, Total count    =          984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.00s, 690.03KB read
Requests/sec:     50.13
Transfer/sec:     23.00KB
